package Test;

public class Sample {
	public static void main(String[] args) {
		//변수: 데이터를 담을 수 있는 상자 - 컴퓨터와 의사소통 수단
		//변수상자에는 데이터를 바꿔담을 수 있지만 하나의 데이터만 들어갈 수 있다
		//변수상자의 이름이 중복되면 안됨
		//변수 제작법 - 타입 이름;
		int a;
		//int 인티져 숫자가 들어갈수있는 상자 / 통상 21억
		a=45000;
		System.out.println(a);
		a=3535;
		System.out.println(a);
		//전산에서 = 는 왼쪽에다가 오른쪽것을 넣어라
		//정의-변수 조건 동작
		
		//변수 작명규칙(안지키면 오류)
		//1. 변수의 이름은 숫자로 시작할 수 없다.
		//2. 이름에는 띄어쓰기를 사용할 수 없다.
		//3. 특수문자는 $ _ 이 두가지만 사용가능
		//4. 사용중인 이름은 중복 불가능****
		//5. 대문자와 소문자 구분
		
		//작명 권장사항
		//1. 파스칼표기법: 모든 단어의 첫문자를 대문자로 표기 ( JavaHtmlCss) 클래스명 표기시 사용
		//2. 카멜표기법: 두번째단어부터 첫 문자를 대문자로 표기 ( javaHtmlCss) 동작(메서드)이름표기시사용
		//3. 팟홀표기법: 띄어쓰기대신 _를 사용 ( java_html_css) 변수이름 표기시 사용
	}

}
